''' 
 Пользователь вводит число K - количество фруктов.
 Затем он вводит K фруктов в формате: название фрукта и его количество.
 Добавьте все фрукты в словарь, где название фрукта - это ключ, а количество - значение.
'''


K = int(input("Введите число фруктов: "))
= = {}

for index in range (K):
    key = input("Введите фрукт: ")
    value = input("Введите его количество: ")
    fruits[key] = value

print(fruits)